Revit 2024 API
BuiltInFailures.RenderFailures Class
 Failures related to rendering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class RenderFailures
Visual Basic
Public NotInheritable Class RenderFailures
Visual C++
public ref class RenderFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RenderFailures
See Also
BuiltInFailures.RenderFailures Members
Autodesk.Revit.DB Namespace